ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_canfd.h
/***************************************************************************//**
* \file cy_canfd.h
* \version 1.0
*
*  This file provides constants and parameter values for 
*  the CAN FD driver.
*
********************************************************************************
* \copyright
* Copyright 2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_canfd
* \{
* The CAN FD driver provides an easy method to access the CAN FD IP block registers
* and provides simple functionality for sending and receiving data between 
* devices in the CAN FD network.
* The CAN FD driver provides an API to configure the main features - mode, bit time,
* message buffers - and transmit and receive message in all modes:
* - Classic CAN	using 11-bit identifiers
* - Classic CAN	using 29-bit identifiers
* - CAN Flexible Data using 11-bit identifiers
* - CAN Flexible Data using 29-bit identifiers.
*
* \image html canfd_solution.png "CAN FD Solution" width=948px
* \image latex canfd_solution.png
*
*
* \section group_canfd_section_configuration Configuration Considerations
* Specification of the sample code is as follows:
*   - Selectable CAN FD mode or CAN mode
*   - Configurable CAN clock
*   - Configurable CAN Bit rate
*   - Configurable CAN FD Bit rate
*   - Configurable Standard ID filter
*   - Configurable Extended Message ID Filter
*   - Tx-Rx Element Size : 8 bytes (CAN mode)
*   - Tx-Rx Element Size : 64 bytes (CAN FD mode)
*   - Rx FIFO configuration
*   - Interrupts : \n
*                  CY_CANFD_RX_FIFO_0_NEW_MESSAGE (Message stored to Rx FIFO 0) \n
*                  CY_CANFD_RX_FIFO_1_NEW_MESSAGE (Message stored to Rx FIFO 1) \n
*                  CY_CANFD_RX_BUFFER_NEW_MESSAGE (Message stored to Dedicated Rx Buffer). \n
*
* Sends data of ID:0x200 periodically in the main().
* Echobacks received data by incrementing the ID of the received packet in
* the receiving interrupt.(CanFDIrqHandler() --- CanFDCallbackRx())
*
* \subsection group_canfd_section_configuration_personalities Use ModusToolbox Device Configurator Tool to generate initialization code 
* The steps to generate initialization code using 
* the ModusToolbox Device Configurator Tool:
* 
* 1. Launch the ModusToolbox Device Configurator Tool.
* 2. Switch to the Peripherals tab. Enable the CAN FD channel personality 
*    under Communication and enter Alias (default is canfd_0_chan_0).
* 3. Go to the Parameters Pane for the CAN FD Personality and configure it with
*    the desired parameters (set the Clock Signal divider, set the bit timing
*    configuration, set the other parameters per Configuration Considerations, etc).
* 4. Perform File->Save for the initialization code to generate.
*
* Now, all required CAN FD initialization code and configuration prerequisites will be generated:
* 
* - The Peripheral Clock Divider assignment and analog routing are parts of the
*   init_cycfg_all() routine. Place the call of the init_cycfg_all() function 
*   before using any CAN FD API functions to ensure initialization of all external
*   resources required for the CAN FD operation.
* - The CAN FD configuration structure declaration is in the cycfg_peripherals.h
*   file and its initialization is in the cycfg_peripherals.c file. The variable
*   name is \<CAN_FD_Alias_Name\>_config (default is canfd_0_chan_0_config). It 
*   must be used with Cy_CANFD_Init() function.
* - TX buffers structures are initialized. Use these structures to send data.
* 
* For the CAN FD interrupt service routine, Cy_CANFD_IrqHandler() can be used. 
* It handles reading data from the dedicated RX buffers and RX FIFO buffers. 
* Corresponding callback functions are called for error interrupts, RX 
* interrupts and TX complete interrupt. Put the names of callback functions to
* the Callback functions parameters section. Put NULL if no callback function to
* be used.
* \note Only RX interrupt sources are enabled by default. 
* Use Cy_CANFD_SetInterruptMask() to enable other interrupt sources.
* \note Interrupt flags are set regardless of the interrupt enable register. 
* Cy_CANFD_IrqHandler will check and process all supported interrupts when 
* triggered with any enabled interrupt source.
*
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_ISR
*
* Set up the interrupt handler to be called with CAN FD events. The CAN FD block
* has two interrupt lines which can be assigned to different interrupt 
* sources using Cy_CANFD_SetInterruptLine(): canfd_0_interrupts0_0_IRQn
* and canfd_0_interrupts1_0_IRQn. Also, the CAN FD block has a consolidated interrupt
* canfd_0_interrupt0_IRQn. The following code shows how to set up the interrupt 
* handler.
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_Setup_CANFD_Interrupt
*
* \subsection group_canfd_section_configuration_manual Implement the initialization code manually
* Call Cy_CANFD_Init() to initialize the CAN FD module. 
* It initializes the CAN FD module with the configuration parameters, passed
* in the \ref cy_stc_canfd_config_t structure. It consists of several elements 
* to be defined first. 
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_Config_Struct
* The Cy_CANFD_Init() function also initializes the shared context structure
* used later with other API functions.
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_context
* Although the callback functions are optional, they are recommended for use, 
* otherwise, there is no report to the API about any error and transmission or reception events. 
* The example callback function sends received data back to the bus, 
* incrementing ID by 1:
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_RX_callback
* CAN FD IP block requires the configuration of a peripheral clock divider. 
* The following code configures an 8-bit clock divider. The default peripheral 
* clock frequency is 72 MHz. The desired divider value minus one must be passed.
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_Assign_Clock_Divider
* The CAN FD block uses the Port 5 pins for receive (P5[0]) and transmit (P5[1]).
* - Connect the specified High-Speed Input Output Multiplexer (HSIOM) selection
* to the pin.
* - Set the pins drive mode for RX and TX.
*
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_Assign_CANFD_Pins
*
* For the CANFD interrupt service routine, the Cy_CANFD_IrqHandler() can be used. 
* It handles reading data from dedicated RX buffers and RX FIFO buffers. 
* Corresponding callback functions are called for error interrupts, RX 
* interrupts and TX complete interrupt. 
* \note Only RX interrupt sources are enabled by default. 
* Use Cy_CANFD_SetInterruptMask() to enable other interrupt sources.
* \note Interrupt flags are set regardless of the interrupt enable register. 
* Cy_CANFD_IrqHandler will check and process all supported interrupts when 
* triggered with any enabled interrupt source.
*
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_ISR
*
* Setup the interrupt handler to be called with the CAN FD events. The CAN FD block
* has two interupt lines, which can be assigned to different interrupt 
* sources using Cy_CANFD_SetInterruptLine(): canfd_0_interrupts0_0_IRQn
* and canfd_0_interrupts1_0_IRQn. Also, the CAN FD block has a consolidated interrupt
* canfd_0_interrupt0_IRQn. The following code shows how to set up the interrupt 
* handler.
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_Setup_CANFD_Interrupt
*
* CAN FD has two bit rate settings, for arbitration and data phases. Both are 
* configured with the same structure, containing a pre-scaler, time segment 1, 
* time segment 2 and synchronization jump width.
* \note The actual interpretation by the hardware of configured values is
* one more value than programmed.
* \note The bit rate configured for the CAN FD data phase must be higher or equal to
* the bit rate configured for the arbitration phase. 
*
* The CAN time quantum (tq) may be programmed in the range of 1 to 32 CAN FD clock
* periods: tq = (prescaler + 1) mtq, where mtq is CAN FD block's clock period.
* The length of the bit time is (programmed values) 
* [timeSegment1 + timeSegment2 + 3] tq. \n
* The example below shows the configuration with the 100 kbps arbitration bit rate
* and 200 kbps data bit rate. This assumes the peripheral clock frequency of 72 MHz 
* divided by 9 to obtain the 8 MHz clock for the CAN FD block.
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_Bitrate
* CAN FD driver provides API to setup Message ID filtering. There are standard 
* ID and extended ID filters. The desired count of the filters of each type is 
* specified in the \ref cy_stc_canfd_config_t structure and is set once during
* block initialization. It is possible to change the configured 
* filters settings with Cy_CANFD_SidFilterSetup() and Cy_CANFD_XidFilterSetup().
* Use the cy_stc_id_filter_t structure to set up one standard ID filter: 
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_SID_Filter
* Use the cy_stc_extid_filter_t structure to set up an extended ID filter:
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_XID_Filter
* Message IDs that do not match any filter are received according to the global
* filter set up. The global filter can be set up to receive messages with standard
* and extended IDs to different FIFO buffers. It can be configured to reject remote
* frames, as shown below.
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_Global_Filter
* The RX FIFO buffers, FIFO 0 and FIFO 1 are configured once on block
* initialization using cy_en_canfd_fifo_config_t structure.
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_FIFO_Config
* The cy_stc_canfd_config_t structure is used to pass all configuration to 
* Cy_CANFD_Init() function. It is populated with pointers to other structures
* required and constants, defined before.
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_Config_Struct
* The Cy_CANFD_Init() function initializes the CAN FD block by writing CAN FD
* configuration registers. Cy_CANFD_Init() enables the RX interrupts for 
* new message reception into the dedicated RX buffers, FIFO 0 and FIFO 1.
* The code example also shows the test mode configuration which can be used to
* enable the Loopback mode. See \ref cy_stc_canfd_test_mode_t for details.
* Cy_CANFD_Init() sets test mode configuration to CY_CANFD_TEST_MODE_DISABLE.
* Remember to disable the echo functionality in the RX callback when using a loopback.
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_Init_Example
* To send a CAN FD message, a TX buffer structure must be prepared  
* which consists of the T0 and T1 registers and data array.
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_Prepare_TX
* To transmit CAN FD messages, the function \ref Cy_CANFD_UpdateAndTransmitMsgBuffer()
* is used. The buffer status can be retrieved by Cy_CANFD_GetTxBufferStatus().
* It is possible to set a callback function which will be notified whenever a
* message transmission has been completed.
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_Send_TX 
* 
* \section group_canfd_section_more_information More Information
* 
* For more information on the CAN FD peripheral, refer to the technical 
* reference manual (TRM).
*
* \section group_canfd_MISRA MISRA-C Compliance
* The CAN FD driver does not have any specific deviations.
*
* \section group_canfd_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_canfd_macros Macros
* \{
    \defgroup group_canfd_rx_interrupt_masks RX Interrupt masks
    \defgroup group_canfd_tx_interrupt_masks TX Interrupt masks
    \defgroup group_canfd_error_interrupt_masks Error Interrupt masks
    \defgroup group_canfd_interrupt_line_masks Interrupt line selection masks
    \defgroup group_canfd_last_state_masks Protocol Status Register (PSR) masks
* \}
* \defgroup group_canfd_functions Functions
* \defgroup group_canfd_data_structures Data Structures
* \defgroup group_canfd_enums Enumerated Types
*
*/

